// 1․ փոխել a և b արժեքները առանց նոր փոփոխական հայտարարելու և օգտագործել միայն  a  և b 
// let a = 5;
// let b = 6


// 2․ պարզել արդյոք մուտքագրված կամայական x արժեքից անմնացորդ արմատ դուրս գալիս է թե ոչ
// let x = 64;


// 3․ պարզել արդյոք մուտքագրված կամայական x և y արժեքների տարբերությունից դուրս գալիս է անմնացորդ արմատ
// let x = 64;
// let y = 41


// 4․ ծրագիրը պետք է ասի true միայն այն դեպքում, եթե փոփոխականն անմնացորդ բաժանվում է 4-ի և չի բաժանվում 6-ի
// let x = 64;


// 5․ ծրագիրը պետք է ասի true, եթե երկու փոփոխականների գումարը կենտ է
// let x = 64;
// let y = 215


// 6․ ծրագիրը պետք է ասի թե մուտք արած տարեթիվը որ դարն է
// let x = 1901;



// 7․ ասեք թվանշանների քանակը, օգտագործելով միայն ջավասկրիպտի թիվ (number datatype) տեսակը
//  let x = 5456845;


// 8․ Շրջեք թիվը, օգտագործելով միայն ջավասկրիպտի թիվ (number datatype) տեսակը
//  let x = 5456845;


// 9․ ջավասկրիպտով գտեք տրված երկու փոփոխականների (a+b)-ի քառակուսու բանաձևը
//  let a = 7,
//  let b = 4


// 10․  պարզել արդյոք փոփոխականում պահված արժեքը պարզ թիվ է թե ոչ
// let a = 17;


// 11  պարզել արդյոք փոփոխականում պահված արժեքը պարզ թիվ է թե ոչ, եթե ոչ ապա նրանից մեծ առաջիկա 5 թվերի մեջ կա պարզ թիվ թե ոչ
//  let x = 18;


// 12  պարզել արդյոք թիվը երջանիկ թիվ է թե ոչ (առաջին կեսի թվանշանների ումարն հավասար է երկրոդ կեսի թվանշանների գումարին)
//  let x = 185419;


// 13․ գտնել l տառերի քանակը
// let string = 'hello world'


// 14 Արդյոք մեր փոփոխականն սկսվում է a տառով և վերջանում ? (Հարցական) նշանով
// let str = 'whats up?'


// 15 պարզել արդյոք մեր փոփոխականն պարունակում է give բառը
// let str = 'never give up'


// 16 պարզել թվերի քանակը փոփոխականի մեջ
// let str = 'wow it is 84 and abc';


// 17 ստեղծել նոր փոփոխական, որտեղ բոլոր տառերը կլինեն մեծատառ իսկ բացատների փոխարեն + նշան
// let str = 'abc q l d z';


// 18 հաշվել բացատների քանակը
// let str = 'never and never say it again';


// 19 շրջեք տող տիպի փոփոծականը
// let str = 'abc def';


// 20 Արդյոք մեր տող տեսակի փոփոխականը պոլինդրոմ է, պոլինդրոմ է համարվում, երբ ձախից աջ և աջից ձախ կարդալիս ստացվում է նույն բառը
// let str = 'mam';



// 21 Պարզել քանի սիմվոլ կա, որ անգլերեն տառեր չեն
// let str = "that is it 47 hello 14 wold фывввաաա 22";


// 22 Պարզել Z  տառերն են շատ թե  A, Էական չէ մեծատառ ու փոքրատառ լինելը
// let str = 'abaaaZZZzbabcbabczzzAabZzZA';



// 23 Որ փոփոխականի մեջ է գերակշռում մեծատառեր
// let str = 'ascadAAAddax';
// let str1 = 'axxZZxz';













